In [1]:
import pandas as pd

In [12]:
data = {'Name':['A','B','C','D','E','F'],
        'age' : [23,24,54,75,63,90],
        'city':['NY','LN','ND','ND','NY','']
       }

In [13]:
df = pd.DataFrame(data)

In [14]:
df_s = pd.Series(data)

In [15]:
df

  Name  age city
0    A   23   NY
1    B   24   LN
2    C   54   ND
3    D   75   ND
4    E   63   NY
5    F   90

In [16]:
df_s

Name          [A, B, C, D, E, F]
age     [23, 24, 54, 75, 63, 90]
city      [NY, LN, ND, ND, NY, ]
dtype: object

In [17]:
df['age']

0    23
1    24
2    54
3    75
4    63
5    90
Name: age, dtype: int64

In [18]:
df['city']

0    NY
1    LN
2    ND
3    ND
4    NY
5
Name: city, dtype: object

In [19]:
df.city

0    NY
1    LN
2    ND
3    ND
4    NY
5
Name: city, dtype: object

In [20]:
df.age<30

0     True
1     True
2    False
3    False
4    False
5    False
Name: age, dtype: bool

In [21]:
df[df.age<30]

  Name  age city
0    A   23   NY
1    B   24   LN

In [22]:
df

  Name  age city
0    A   23   NY
1    B   24   LN
2    C   54   ND
3    D   75   ND
4    E   63   NY
5    F   90

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   age     6 non-null      int64
 2   city    6 non-null      object
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [26]:
df['salary'] = [50000,70000,30000,40000,26000,52000]

In [27]:
df

  Name  age city  salary
0    A   23   NY   50000
1    B   24   LN   70000
2    C   54   ND   30000
3    D   75   ND   40000
4    E   63   NY   26000
5    F   90        52000

In [28]:
df.describe()

             age        salary
count   6.000000      6.000000
mean   54.833333  44666.666667
std    27.110269  16182.294852
min    23.000000  26000.000000
25%    31.500000  32500.000000
50%    58.500000  45000.000000
75%    72.000000  51500.000000
max    90.000000  70000.000000

In [31]:
df_sorted = df.sort_values(by= 'salary', ascending= False)

In [32]:
df_sorted

  Name  age city  salary
1    B   24   LN   70000
5    F   90        52000
0    A   23   NY   50000
3    D   75   ND   40000
2    C   54   ND   30000
4    E   63   NY   26000

In [34]:
df_average_age_by_city = df.groupby('city')['age'].mean()
print(df_average_age_by_city)

city
      90.0
LN    24.0
ND    64.5
NY    43.0
Name: age, dtype: float64

In [37]:
df.isnull().sum()

Name      0
age       0
city      0
salary    0
dtype: int64

In [38]:
df

  Name  age city  salary
0    A   23   NY   50000
1    B   24   LN   70000
2    C   54   ND   30000
3    D   75   ND   40000
4    E   63   NY   26000
5    F   90        52000

In [34]:
df.value_counts()

Name  age  city
A     23   NY      1
B     24   LN      1
C     54   ND      1
D     75   ND      1
E     63   NY      1
F     90           1
dtype: int64

In [53]:
df['salary'] = df['salary'].astype(float)

In [54]:
df

  Name  age city   salary
0    A   23   NY  50000.0
1    B   24   LN  70000.0
2    C   54   ND  30000.0
3    D   75   ND  40000.0
4    E   63   NY  26000.0
5    F   90       52000.0

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   age     6 non-null      int64
 2   city    6 non-null      object
 3   salary  6 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 324.0+ bytes

In [56]:
df_iris = pd.read_csv(rC:\Users\TRPL\Desktop\DevTown Folders\Projects\Iris Data Prediction(EDA, LDA)\Iris.csv")

In [57]:
df_iris

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [58]:
df_iris.shape

(150, 6)

In [59]:
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Id             150 non-null    int64
 1   SepalLengthCm  150 non-null    float64
 2   SepalWidthCm   150 non-null    float64
 3   PetalLengthCm  150 non-null    float64
 4   PetalWidthCm   150 non-null    float64
 5   Species        150 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 7.2+ KB

In [43]:
df_iris.describe()

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

In [44]:
df_numeric = df_iris['SepalWidthCm']

In [45]:
df_numeric

0      3.5
1      3.0
2      3.2
3      3.1
4      3.6
      ...
145    3.0
146    2.5
147    3.0
148    3.4
149    3.0
Name: SepalWidthCm, Length: 150, dtype: float64

In [46]:
df_numeric_doubled = df_numeric.apply(lambda x : 2*x)

In [47]:
df_numeric_doubled

0      7.0
1      6.0
2      6.4
3      6.2
4      7.2
      ...
145    6.0
146    5.0
147    6.0
148    6.8
149    6.0
Name: SepalWidthCm, Length: 150, dtype: float64

In [48]:
df.drop('salary', axis = 1)

  Name  age city
0    A   23   NY
1    B   24   LN
2    C   54   ND
3    D   75   ND
4    E   63   NY
5    F   90